[
  {
    "numero": 3015,
    "bookName": "The Book of Commentary on the Qur'an",
    "hadithNarrated": "Hammim b. Munabbih reported:",
    "matn_en": "Hammim b. Munabbih reported:This is what Abu Huraira reported to us from Allah's Messenger (ﷺ) and in this connection he narrated some of the ahadith and Allah's Messenger (ﷺ) said: It was said to people of Israel: Enter this land saying Hitta (Remove Thou from us the burden of our sins), whereupon We would forgive you your sins, but they twisted (this statement) and entered the gate dragging upon their breech and said: The\" grain in the ear.\"",
    "matn_ar": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، حَدَّثَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، قَالَ هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم ‏.‏ فَذَكَرَ أَحَادِيثَ مِنْهَا وَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏\n\"‏ قِيلَ لِبَنِي إِسْرَائِيلَ ‏{‏ ادْخُلُوا الْبَابَ سُجَّدًا وَقُولُوا حِطَّةٌ يُغْفَرْ لَكُمْ خَطَايَاكُمْ‏}‏ فَبَدَّلُوا فَدَخَلُوا الْبَابَ يَزْحَفُونَ عَلَى أَسْتَاهِهِمْ وَقَالُوا حَبَّةٌ فِي شَعَرَةٍ\"‏ ‏.‏"
  },
  {
    "numero": 3016,
    "bookName": "The Book of Commentary on the Qur'an",
    "matn_en": "Anas b. Malik reported that Allah, the Exalted and Glorious, sent revelation to Allah's Messenger (ﷺ) just before his death in quick succession until he left for his heavenly home, and the day when he died, he received the revelation profusely.",
    "matn_ar": "حَدَّثَنِي عَمْرُو بْنُ مُحَمَّدِ بْنِ بُكَيْرٍ النَّاقِدُ، وَالْحَسَنُ بْنُ عَلِيٍّ الْحُلْوَانِيُّ، وَعَبْدُ بْنُ، حُمَيْدٍ - قَالَ عَبْدٌ حَدَّثَنِي وَقَالَ الآخَرَانِ، حَدَّثَنَا يَعْقُوبُ، - يَعْنُونَ ابْنَ إِبْرَاهِيمَ بْنِ سَعْدٍ - حَدَّثَنَا أَبِي، عَنْ صَالِحٍ، - وَهُوَ ابْنُ كَيْسَانَ - عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي أَنَسُ بْنُ، مَالِكٍ أَنَّ اللَّهَ، عَزَّ وَجَلَّ تَابَعَ الْوَحْىَ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم قَبْلَ وَفَاتِهِ حَتَّى تُوُفِّيَ وَأَكْثَرُ مَا كَانَ الْوَحْىُ يَوْمَ تُوُفِّيَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏.‏"
  },
  {
    "numero": 3017,
    "bookName": "The Book of Commentary on the Qur'an",
    "hadithNarrated": "Tariq b. Shihab reported that a Jew said to'Umar:",
    "matn_en": "Tariq b. Shihab reported that a Jew said to'Umar:You recite a verse which, if it had been revealed in relation to us, we would have taken that day as the day of rejoicing. Thereupon 'Umar said: I know where it was revealed and on the day when it was revealed and where Allah's Messenger (ﷺ) had been at that time when it was revealed. It was revealed on the day of 'Arafa (ninth of Dhu'l Hijjah) and Allah's Messenger (ﷺ) had been staying in 'Arafat. Sufyan said: I doubt, whether it was Friday or not (and the verse referred to) is this:\" Today I have perfected your religion for you and completed My favours upon you\" (v. 4).",
    "matn_ar": "حَدَّثَنِي أَبُو خَيْثَمَةَ، زُهَيْرُ بْنُ حَرْبٍ وَمُحَمَّدُ بْنُ الْمُثَنَّى - وَاللَّفْظُ لاِبْنِ الْمُثَنَّى - قَالاَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ، - وَهُوَ ابْنُ مَهْدِيٍّ - حَدَّثَنَا سُفْيَانُ، عَنْ قَيْسِ بْنِ مُسْلِمٍ، عَنْ طَارِقِ، بْنِ شِهَابٍ أَنَّ الْيَهُودَ، قَالُوا لِعُمَرَ إِنَّكُمْ تَقْرَءُونَ آيَةً لَوْ أُنْزِلَتْ فِينَا لاَتَّخَذْنَا ذَلِكَ الْيَوْمَ عِيدًا ‏.‏ فَقَالَ عُمَرُ إِنِّي لأَعْلَمُ حَيْثُ أُنْزِلَتْ وَأَىَّ يَوْمٍ أُنْزِلَتْ وَأَيْنَ رَسُولُ اللَّهِ صلى الله عليه وسلم حَيْثُ أُنْزِلَتْ أُنْزِلَتْ بِعَرَفَةَ وَرَسُولُ اللَّهِ صلى الله عليه وسلم وَاقِفٌ بِعَرَفَةَ ‏.‏ قَالَ سُفْيَانُ أَشُكُّ كَانَ يَوْمَ جُمُعَةٍ أَمْ لاَ ‏.‏ يَعْنِي ‏{‏ الْيَوْمَ أَكْمَلْتُ لَكُمْ دِينَكُمْ وَأَتْمَمْتُ عَلَيْكُمْ نِعْمَتِي‏}‏"
  },
  {
    "numero": 3018,
    "bookName": "The Book of Commentary on the Qur'an",
    "hadithNarrated": "'Urwa b. Zubair reported that he asked 'A'isha about the words of Allah:",
    "matn_en": "'Urwa b. Zubair reported that he asked 'A'isha about the words of Allah:\" If you fear that you will not be able to maintain equity amongst the orphan girls, then marry (those) you like from amongst the women two, three or four.\" She said: O, the son of my sister, the orphan girl is one who is under the patronage of her guardian and she shares with him in his property and her property and beauty fascinate him and her guardian makes up his mind to marry her without giving her due share of the wedding money and is not prepared (to pay so much amount) which anyone else is prepared to pay and so Allah has forbidden to marry these girls but in case when equity is observed as regards the wedding money and they are prepared to pay them the full amount of the wedding money and Allah commanded to marry other women besides them according to the liking of their heart. 'Urwa reported that 'A'isha said that people began to seek verdict from Allah's Messenger (ﷺ) after the revelation of this verse about them (orphan girls) and Allah, the Exalted and Glorious, revealed this verse:\" They asked thee verdict about women; say: Allah gives verdict to you in regard to them and what is recited to you in the Book about orphan woman, whom you give not what is ordained for them while you like to marry them\" (iv. 126). She said: The wording of Allah\" what is recited to you\" in the Book means the first verse, i. e.\" if you fear that you may not be able to observe equity in case of an orphan woman, marry what you like in case of woman\" (iv. 3). 'A'isha said: (And as for this verse [iv. 126], i. e. and you intend\" to marry one of them from amongst the orphan girls\" it pertains to one who is in charge (of orphans) having small amount of wealth and less beauty and they have been forbidden that they should marry what they like of her wealth and beauty out of the orphan girls, but with equity, because of their disliking for them.",
    "matn_ar": "حَدَّثَنِي أَبُو الطَّاهِرِ، أَحْمَدُ بْنُ عَمْرِو بْنِ سَرْحٍ وَحَرْمَلَةُ بْنُ يَحْيَى التُّجِيبِيُّ - قَالَ أَبُو الطَّاهِرِ حَدَّثَنَا وَقَالَ، حَرْمَلَةُ أَخْبَرَنَا - ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّهُ سَأَلَ عَائِشَةَ عَنْ قَوْلِ اللَّهِ، ‏{‏ وَإِنْ خِفْتُمْ أَنْ لاَ، تُقْسِطُوا فِي الْيَتَامَى فَانْكِحُوا مَا طَابَ لَكُمْ مِنَ النِّسَاءِ مَثْنَى وَثُلاَثَ وَرُبَاعَ‏}‏ قَالَتْ يَا ابْنَ أُخْتِي هِيَ الْيَتِيمَةُ تَكُونُ فِي حَجْرِ وَلِيِّهَا تُشَارِكُهُ فِي مَالِهِ فَيُعْجِبُهُ مَالُهَا وَجَمَالُهَا فَيُرِيدُ وَلِيُّهَا أَنْ يَتَزَوَّجَهَا بِغَيْرِ أَنْ يُقْسِطَ فِي صَدَاقِهَا فَيُعْطِيَهَا مِثْلَ مَا يُعْطِيهَا غَيْرُهُ فَنُهُوا أَنْ يَنْكِحُوهُنَّ إِلاَّ أَنْ يُقْسِطُوا لَهُنَّ وَيَبْلُغُوا بِهِنَّ أَعْلَى سُنَّتِهِنَّ مِنَ الصَّدَاقِ وَأُمِرُوا أَنْ يَنْكِحُوا مَا طَابَ لَهُمْ مِنَ النِّسَاءِ سِوَاهُنَّ ‏.‏ قَالَ عُرْوَةُ قَالَتْ عَائِشَةُ ثُمَّ إِنَّ النَّاسَ اسْتَفْتَوْا رَسُولَ اللَّهِ صلى الله عليه وسلم بَعْدَ هَذِهِ الآيَةِ فِيهِنَّ فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ ‏{‏ وَيَسْتَفْتُونَكَ فِي النِّسَاءِ قُلِ اللَّهُ يُفْتِيكُمْ فِيهِنَّ وَمَا يُتْلَى عَلَيْكُمْ فِي الْكِتَابِ فِي يَتَامَى النِّسَاءِ اللاَّتِي لاَ تُؤْتُونَهُنَّ مَا كُتِبَ لَهُنَّ وَتَرْغَبُونَ أَنْ تَنْكِحُوهُنَّ‏}‏ ‏.‏ قَالَتْ وَالَّذِي ذَكَرَ اللَّهُ تَعَالَى أَنَّهُ يُتْلَى عَلَيْكُمْ فِي الْكِتَابِ الآيَةُ الأُولَى الَّتِي قَالَ اللَّهُ فِيهَا ‏{‏ وَإِنْ خِفْتُمْ أَنْ لاَ تُقْسِطُوا فِي الْيَتَامَى فَانْكِحُوا مَا طَابَ لَكُمْ مِنَ النِّسَاءِ‏}‏ ‏.‏ قَالَتْ عَائِشَةُ وَقَوْلُ اللَّهِ فِي الآيَةِ الأُخْرَى ‏{‏ وَتَرْغَبُونَ أَنْ تَنْكِحُوهُنَّ‏}‏ رَغْبَةَ أَحَدِكُمْ عَنِ الْيَتِيمَةِ الَّتِي تَكُونُ فِي حَجْرِهِ حِينَ تَكُونُ قَلِيلَةَ الْمَالِ وَالْجَمَالِ فَنُهُوا أَنْ يَنْكِحُوا مَا رَغِبُوا فِي مَالِهَا وَجَمَالِهَا مِنْ يَتَامَى النِّسَاءِ إِلاَّ بِالْقِسْطِ مِنْ أَجْلِ رَغْبَتِهِمْ عَنْهُنَّ ‏.‏"
  },
  {
    "numero": 3019,
    "bookName": "The Book of Commentary on the Qur'an",
    "hadithNarrated": "Hisham reported on the authority of his father that 'A'isha said in connection with His (Allah's) words:",
    "matn_en": "Hisham reported on the authority of his father that 'A'isha said in connection with His (Allah's) words:\" And whoever is poor let him take reasonably (out of it)\" that it was revealed in connection with the custodian of the property of an orphan, who is in charge of her and looks after her; In case he is poor, he is allowed to eat out of that.",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، فِي قَوْلِهِ ‏{‏ وَمَنْ كَانَ فَقِيرًا فَلْيَأْكُلْ بِالْمَعْرُوفِ‏}‏ قَالَتْ أُنْزِلَتْ فِي وَالِي مَالِ الْيَتِيمِ الَّذِي يَقُومُ عَلَيْهِ وَيُصْلِحُهُ إِذَا كَانَ مُحْتَاجًا أَنْ يَأْكُلَ مِنْهُ ‏.‏"
  },
  {
    "numero": 3020,
    "bookName": "The Book of Commentary on the Qur'an",
    "hadithNarrated": "'A'isha reported that these words of Allah:",
    "matn_en": "'A'isha reported that these words of Allah:\" When they came upon you from above you and from below you and when the eyes turned dull and the hearts rose up to the throats\" (xxxiii. 10) pertain to the day of Ditch.",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، فِي قَوْلِهِ عَزَّ وَجَلَّ ‏{‏ إِذْ جَاءُوكُمْ مِنْ فَوْقِكُمْ وَمِنْ أَسْفَلَ مِنْكُمْ وَإِذْ زَاغَتِ الأَبْصَارُ وَبَلَغَتِ الْقُلُوبُ الْحَنَاجِرَ‏}‏ قَالَتْ كَانَ ذَلِكَ يَوْمَ الْخَنْدَقِ ‏.‏"
  },
  {
    "numero": 3021,
    "bookName": "The Book of Commentary on the Qur'an",
    "hadithNarrated": "'A'isha said in connection with the verse:",
    "matn_en": "'A'isha said in connection with the verse:\" And if a woman has reason to fear ill-treatment from her husband or that he might turn away from her\" (iv. 128) that it was revealed in case of a woman who had long association with a person (as his wife) and now he intends to divorce her and she says: Do not divorce me, but retain me (as wife in your house) and you are permitted to live with another wife. It is in this context that this verse was revealed.",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ، حَدَّثَنَا هِشَامٌ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، ‏{‏ وَإِنِ امْرَأَةٌ خَافَتْ مِنْ بَعْلِهَا نُشُوزًا أَوْ إِعْرَاضًا‏}‏ الآيَةَ قَالَتْ أُنْزِلَتْ فِي الْمَرْأَةِ تَكُونُ عِنْدَ الرَّجُلِ فَتَطُولُ صُحْبَتُهَا فَيُرِيدُ طَلاَقَهَا فَتَقُولُ لاَ تُطَلِّقْنِي وَأَمْسِكْنِي وَأَنْتَ فِي حِلٍّ مِنِّي ‏.‏ فَنَزَلَتْ هَذِهِ الآيَةُ ‏.‏"
  },
  {
    "numero": 3022,
    "bookName": "The Book of Commentary on the Qur'an",
    "hadithNarrated": "'Urwa reported on the authority of his father that 'A'isha said to him:",
    "matn_en": "'Urwa reported on the authority of his father that 'A'isha said to him:O, the son of my sister, the Muslims were commanded to seek forgiveness for the Companions of Allah's Apostle (ﷺ) but they reviled them.",
    "matn_ar": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا أَبُو مُعَاوِيَةَ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، قَالَ قَالَتْ لِي عَائِشَةُ يَا ابْنَ أُخْتِي أُمِرُوا أَنْ يَسْتَغْفِرُوا، لأَصْحَابِ النَّبِيِّ صلى الله عليه وسلم فَسَبُّوهُمْ ‏.‏"
  },
  {
    "numero": 3023,
    "bookName": "The Book of Commentary on the Qur'an",
    "hadithNarrated": "Sa'id b. Jubair reported:",
    "matn_en": "Sa'id b. Jubair reported:The inhabitants of Kufa differed in regard to this verse:\" But whoever slays another believer intentionally, his requital shall be Hell\" (iv. 92), so I went to Ibn 'Abbas and asked him about it, whereupon he said: This has been revealed and nothing abrogated it.",
    "matn_ar": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ الْعَنْبَرِيُّ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنِ الْمُغِيرَةِ بْنِ النُّعْمَانِ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، قَالَ اخْتَلَفَ أَهْلُ الْكُوفَةِ فِي هَذِهِ الآيَةِ ‏{‏ وَمَنْ يَقْتُلْ مُؤْمِنًا مُتَعَمِّدًا فَجَزَاؤُهُ جَهَنَّمُ‏}‏ فَرَحَلْتُ إِلَى ابْنِ عَبَّاسٍ فَسَأَلْتُهُ عَنْهَا فَقَالَ لَقَدْ أُنْزِلَتْ آخِرَ مَا أُنْزِلَ ثُمَّ مَا نَسَخَهَا شَىْءٌ ‏.‏"
  },
  {
    "numero": 3024,
    "bookName": "The Book of Commentary on the Qur'an",
    "hadithNarrated": "Ubaidullah b. 'Abdullah b. 'Utba reported:",
    "matn_en": "Ubaidullah b. 'Abdullah b. 'Utba reported:Ibn Abbas said to me: Do you know-and in the words of Harun (another narrator): Are you aware of-the last Sura which was revealed in the Qur'an as a whole? I said: Yes,\" When came the help from Allah and the victory\" (cx.). Thereupon, he said: You have told the truth. And in the narration of Abu Shaiba (the words are): Do you know the Sura? And he did not mention the words\" the last one\".",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَهَارُونُ بْنُ عَبْدِ اللَّهِ، وَعَبْدُ بْنُ حُمَيْدٍ، قَالَ عَبْدٌ أَخْبَرَنَا وَقَالَ الآخَرَانِ، حَدَّثَنَا جَعْفَرُ بْنُ عَوْنٍ، أَخْبَرَنَا أَبُو عُمَيْسٍ، عَنْ عَبْدِ الْمَجِيدِ بْنِ سُهَيْلٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، قَالَ قَالَ لِيَ ابْنُ عَبَّاسٍ تَعْلَمُ - وَقَالَ هَارُونُ تَدْرِي - آخِرَ سُورَةٍ نَزَلَتْ مِنَ الْقُرْآنِ نَزَلَتْ جَمِيعًا قُلْتُ نَعَمْ ‏.‏ ‏{‏ إِذَا جَاءَ نَصْرُ اللَّهِ وَالْفَتْحُ‏}‏ قَالَ صَدَقْتَ ‏.‏ وَفِي رِوَايَةِ ابْنِ أَبِي شَيْبَةَ تَعْلَمُ أَىُّ سُورَةٍ ‏.‏ وَلَمْ يَقُلْ آخِرَ ‏.‏"
  },
  {
    "numero": 3025,
    "bookName": "The Book of Commentary on the Qur'an",
    "hadithNarrated": "Ibn Abbas reported that some Muslims met a person with a small flock of sheep. He said:",
    "matn_en": "Ibn Abbas reported that some Muslims met a person with a small flock of sheep. He said:As-Salam-o-'Alaikum. They caught hold of him and killed him and took possession of his flock. Then this verse was revealed:\" He who meets you and extends you salutations, don't say: You are not a Muslim\" (iv. 94). Ibn 'Abbas, however, recited the word as-Salam instead of\" as-Salam\".",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَأَحْمَدُ بْنُ عَبْدَةَ الضَّبِّيُّ، - وَاللَّفْظُ لاِبْنِ أَبِي شَيْبَةَ - قَالَ حَدَّثَنَا وَقَالَ الآخَرَانِ، أَخْبَرَنَا سُفْيَانُ، عَنْ عَمْرٍو، عَنْ عَطَاءٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ لَقِيَ نَاسٌ مِنَ الْمُسْلِمِينَ رَجُلاً فِي غُنَيْمَةٍ لَهُ فَقَالَ السَّلاَمُ عَلَيْكُمْ ‏.‏ فَأَخَذُوهُ فَقَتَلُوهُ وَأَخَذُوا تِلْكَ الْغُنَيْمَةَ فَنَزَلَتْ ‏{‏ وَلاَ تَقُولُوا لِمَنْ أَلْقَى إِلَيْكُمُ السَّلَمَ لَسْتَ مُؤْمِنًا‏}‏ وَقَرَأَهَا ابْنُ عَبَّاسٍ السَّلاَمَ ‏.‏"
  },
  {
    "numero": 3026,
    "bookName": "The Book of Commentary on the Qur'an",
    "hadithNarrated": "Bara' reported:",
    "matn_en": "Bara' reported:When the Ansar performed the Pilgrimage, they did not enter their houses but from behind. A person from the Ansar came and he began to enter from his door but it was said to him (why he was doing something in contravention to the common practice of coming to the houses from behind). Then this verse was revealed.\" Piety is not that you come to the doors from behind\" (ii. 189).",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا غُنْدَرٌ، عَنْ شُعْبَةَ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ بَشَّارٍ - وَاللَّفْظُ لاِبْنِ الْمُثَنَّى - قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، عَنْ شُعْبَةَ، عَنْ أَبِي إِسْحَاقَ، قَالَ سَمِعْتُ الْبَرَاءَ، يَقُولُ كَانَتِ الأَنْصَارُ إِذَا حَجُّوا فَرَجَعُوا لَمْ يَدْخُلُوا الْبُيُوتَ إِلاَّ مِنْ ظُهُورِهَا - قَالَ - فَجَاءَ رَجُلٌ مِنَ الأَنْصَارِ فَدَخَلَ مِنْ بَابِهِ فَقِيلَ لَهُ فِي ذَلِكَ فَنَزَلَتْ هَذِهِ الآيَةُ ‏{‏وَلَيْسَ الْبِرُّ بِأَنْ تَأْتُوا الْبُيُوتَ مِنْ ظُهُورِهَا‏}‏ ‏.‏"
  },
  {
    "bookName": "The Book of Commentary on the Qur'an",
    "numero": 3027,
    "hadithNarrated": "Ibn Mas'ud said:",
    "matn_en": "Ibn Mas'ud said:Since our acceptance of Islam and the revelation of this verse in which Allah has shown annoyance to us:\" Has not the time yet come for the believers that their hearts should be humble for the remembrance of Allah?\" (lvii. 16), there was a gap of four years.",
    "matn_ar": "حَدَّثَنِي يُونُسُ بْنُ عَبْدِ الأَعْلَى الصَّدَفِيُّ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَخْبَرَنِي عَمْرُو، بْنُ الْحَارِثِ عَنْ سَعِيدِ بْنِ أَبِي هِلاَلٍ، عَنْ عَوْنِ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِيهِ، أَنَّ ابْنَ مَسْعُودٍ، قَالَ مَا كَانَ بَيْنَ إِسْلاَمِنَا وَبَيْنَ أَنْ عَاتَبَنَا اللَّهُ بِهَذِهِ الآيَةِ ‏{‏ أَلَمْ يَأْنِ لِلَّذِينَ آمَنُوا أَنْ تَخْشَعَ قُلُوبُهُمْ لِذِكْرِ اللَّهِ‏}‏ إِلاَّ أَرْبَعُ سِنِينَ ‏.‏"
  },
  {
    "bookName": "The Book of Commentary on the Qur'an",
    "numero": 3028,
    "hadithNarrated": "Ibn Abbas reported:",
    "matn_en": "Ibn Abbas reported:During the pre-Islamic days women circumambulated the Ka'ba nakedly, and said: Who would provide cloth to cover the one who is circumambulating the Ka'ba so that she would cover her private parts? And then she would say: Today will be exposed the whole or the part and what is exposed I shall not make it lawful. It was in this connection that the verse was revealed:\" Adorn yourself at every place of worship\" (vii. 31).",
    "matn_ar": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، ح وَحَدَّثَنِي أَبُو بَكْرِ بْنُ نَافِعٍ، - وَاللَّفْظُ لَهُ - حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ سَلَمَةَ بْنِ كُهَيْلٍ، عَنْ مُسْلِمٍ الْبَطِينِ، عَنْ سَعِيدِ بْنِ، جُبَيْرٍ عَنِ ابْنِ عَبَّاسٍ، قَالَ كَانَتِ الْمَرْأَةُ تَطُوفُ بِالْبَيْتِ وَهِيَ عُرْيَانَةٌ فَتَقُولُ مَنْ يُعِيرُنِي تِطْوَافًا تَجْعَلُهُ عَلَى فَرْجِهَا وَتَقُولُ الْيَوْمَ يَبْدُو بَعْضُهُ أَوْ كُلُّهُ فَمَا بَدَا مِنْهُ فَلاَ أُحِلُّهُ فَنَزَلَتْ هَذِهِ الآيَةَ ‏{‏ خُذُوا زِينَتَكُمْ عِنْدَ كُلِّ مَسْجِدٍ‏}‏"
  },
  {
    "bookName": "The Book of Commentary on the Qur'an",
    "numero": 3029,
    "hadithNarrated": "Jabir reported that 'Abdullah b. Ubayy b. Salul used to say to his slave-girl:",
    "matn_en": "Jabir reported that 'Abdullah b. Ubayy b. Salul used to say to his slave-girl:Go and fetch something for us by committing prostitution. It was in this connection that Allah, the Exalted and Glorious, revealed this verse:\" And compel not your slave-girls to prostitution when they desire to keep chaste in order to seek the frail goods of this world's life, and whoever compels them, then surely after their compulsion Allah is Forgiving, Merciful\" (xxiv. 33).",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ جَمِيعًا عَنْ أَبِي مُعَاوِيَةَ، - وَاللَّفْظُ لأَبِي كُرَيْبٍ - حَدَّثَنَا أَبُو مُعَاوِيَةَ، حَدَّثَنَا الأَعْمَشُ، عَنْ أَبِي سُفْيَانَ، عَنْ جَابِرٍ، قَالَ كَانَ عَبْدُ اللَّهِ بْنُ أُبَىٍّ ابْنُ سَلُولَ يَقُولُ لِجَارِيَةٍ لَهُ اذْهَبِي فَابْغِينَا شَيْئًا فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ ‏{‏ وَلاَ تُكْرِهُوا فَتَيَاتِكُمْ عَلَى الْبِغَاءِ إِنْ أَرَدْنَ تَحَصُّنًا لِتَبْتَغُوا عَرَضَ الْحَيَاةِ الدُّنْيَا وَمَنْ يُكْرِهْهُنَّ فَإِنَّ اللَّهَ مِنْ بَعْدِ إِكْرَاهِهِنَّ‏}‏ لَهُنَّ ‏{‏ غَفُورٌ رَحِيمٌ‏}‏"
  },
  {
    "bookName": "The Book of Commentary on the Qur'an",
    "numero": 3030,
    "hadithNarrated": "Abdullah b. Mas'ud reported in connection with the words of Allah, the Exalted and Glorious:",
    "matn_en": "Abdullah b. Mas'ud reported in connection with the words of Allah, the Exalted and Glorious:\" Those to whom they call upon, themselves seek the means or access to their Lord as to whoever of them becomes nearest\" (xvii. 57) that it related to a party of Jinn who were being worshipped and they embraced Islam but those who worshipped them kept on worshipping them (though the Jinn whom the misguided people worshipped had become Muslims). It was then that this verse was revealed.",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنْ أَبِي مَعْمَرٍ، عَنْ عَبْدِ اللَّهِ، فِي قَوْلِهِ عَزَّ وَجَلَّ ‏{‏ أُولَئِكَ الَّذِينَ يَدْعُونَ يَبْتَغُونَ إِلَى رَبِّهِمُ الْوَسِيلَةَ أَيُّهُمْ أَقْرَبُ‏}‏ قَالَ كَانَ نَفَرٌ مِنَ الْجِنِّ أَسْلَمُوا وَكَانُوا يُعْبَدُونَ فَبَقِيَ الَّذِينَ كَانُوا يَعْبُدُونَ عَلَى عِبَادَتِهِمْ وَقَدْ أَسْلَمَ النَّفَرُ مِنَ الْجِنِّ ‏.‏"
  },
  {
    "bookName": "The Book of Commentary on the Qur'an",
    "numero": 3031,
    "hadithNarrated": "Sa'id b. Jubair reported:",
    "matn_en": "Sa'id b. Jubair reported:I said to Ibn 'Abbas about Sura Tauba, whereupon he said: As for Sura Tauba, it is meant to humiliate (the non-believers and the hypocrites). There is constantly revealed in it (the pronoun) minhum (of them) and minhom (of them, i. e. such is the condition of some of them) till they (the Muslims) thought that none would be left unmentioned out of them who would not be blamed (for one fault or the other). I again said: What about Sura Anfal? He said: It pertains to the Battle of Badr. I again asked him about Sura al-Hashr. He said: It was revealed in connection with (the tribe) of Banu Nadir.",
    "matn_ar": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ مُطِيعٍ، حَدَّثَنَا هُشَيْمٌ، عَنْ أَبِي بِشْرٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، قَالَ قُلْتُ لاِبْنِ عَبَّاسٍ سُورَةُ التَّوْبَةِ قَالَ آلتَّوْبَةِ قَالَ بَلْ هِيَ الْفَاضِحَةُ مَا زَالَتْ تَنْزِلُ وَمِنْهُمْ وَمِنْهُمْ ‏.‏ حَتَّى ظَنُّوا أَنْ لاَ يَبْقَى مِنَّا أَحَدٌ إِلاَّ ذُكِرَ فِيهَا ‏.‏ قَالَ قُلْتُ سُورَةُ الأَنْفَالِ قَالَ تِلْكَ سُورَةُ بَدْرٍ ‏.‏ قَالَ قُلْتُ فَالْحَشْرُ قَالَ نَزَلَتْ فِي بَنِي النَّضِيرِ ‏.‏"
  },
  {
    "bookName": "The Book of Commentary on the Qur'an",
    "numero": 3032,
    "hadithNarrated": "Ibn 'Umar reported that Umar delivered a sermon on the pulpit of Allah's Messenger (ﷺ) and he praised Allah and lauded Him and then said:",
    "matn_en": "Ibn 'Umar reported that Umar delivered a sermon on the pulpit of Allah's Messenger (ﷺ) and he praised Allah and lauded Him and then said:Now coming to the point. Behold I when the command pertaining to the prohibition of wine was revealed, it was prepared from five things: from wheat, barley, date, grape, honey; and wine is that which clouds the intellect; and O people, I wish Allah's Messenger (ﷺ) could have explained to us in (more) detail the laws pertaining to the inheritance of the grandfather, about one who dies leaving no issue, and some of the problems pertaining to interest.",
    "matn_ar": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنْ أَبِي حَيَّانَ، عَنِ الشَّعْبِيِّ، عَنِ ابْنِ عُمَرَ، قَالَ خَطَبَ عُمَرُ عَلَى مِنْبَرِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ ثُمَّ قَالَ أَمَّا بَعْدُ أَلاَ وَإِنَّ الْخَمْرَ نَزَلَ تَحْرِيمُهَا يَوْمَ نَزَلَ وَهْىَ مِنْ خَمْسَةِ أَشْيَاءَ مِنَ الْحِنْطَةِ وَالشَّعِيرِ وَالتَّمْرِ وَالزَّبِيبِ وَالْعَسَلِ ‏.‏ وَالْخَمْرُ مَا خَامَرَ الْعَقْلَ وَثَلاَثَةُ أَشْيَاءَ وَدِدْتُ أَيُّهَا النَّاسُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ عَهِدَ إِلَيْنَا فِيهَا الْجَدُّ وَالْكَلاَلَةُ وَأَبْوَابٌ مِنْ أَبْوَابِ الرِّبَا ‏.‏"
  },
  {
    "bookName": "The Book of Commentary on the Qur'an",
    "numero": 3033,
    "hadithNarrated": "Abu Dharr took an oath that this verse:",
    "matn_en": "Abu Dharr took an oath that this verse:\" These two adversaries who dispute about their Lord\" (xxii. 19) was revealed in connection with those who on the Day of Badr came out (of rows to fight against the non-believers and they were) Hamza, 'Ali, 'Ubaida b. Harith (from the side of the Muslims) and 'Utba and Shaiba, both of them the sons of Rabi'a and Walid b. 'Utba (from the side of the non-believers of Mecca).",
    "matn_ar": "حَدَّثَنَا عَمْرُو بْنُ زُرَارَةَ، حَدَّثَنَا هُشَيْمٌ، عَنْ أَبِي هَاشِمٍ، عَنْ أَبِي مِجْلَزٍ، عَنْ قَيْسِ، بْنِ عُبَادٍ قَالَ سَمِعْتُ أَبَا ذَرٍّ، يُقْسِمُ قَسَمًا إِنَّ ‏{‏ هَذَانِ خَصْمَانِ اخْتَصَمُوا فِي رَبِّهِمْ‏}‏ إِنَّهَا نَزَلَتْ فِي الَّذِينَ بَرَزُوا يَوْمَ بَدْرٍ حَمْزَةُ وَعَلِيٌّ وَعُبَيْدَةُ بْنُ الْحَارِثِ وَعُتْبَةُ وَشَيْبَةُ ابْنَا رَبِيعَةَ وَالْوَلِيدُ بْنُ عُتْبَةَ ‏.‏"
  }
]